backend/app/models/match.rb

    has_many :users, through: :matchmaking

    before_destroy prepend: true do
        self.users.each {|user| user.toggle_in_match}
---
SELECT "users".* FROM "users" INNER JOIN "matchmakings" ON "users"."id" = "matchmakings"."user_id" WHERE "matchmakings"."match_id" = $1  [["match_id", 1]]