backend/app/models/user.rb

UPDATE "users" SET "in_match" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["in_match", true], ["updated_at", "2018-09-11 20:10:06.435613"], ["id", 1]]
---
        def toggle_in_match()
            begin
                self.update(in_match: !self.in_match)