backend/app/controllers/matchmakings_controller.rb

SELECT "matchmakings".* FROM "matchmakings"
---
    def index
        @matchmakings = Matchmaking.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2000], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def create
        begin
            @user = User.find(matchmaking_params[:user_id])
            @match = Match.find(matchmaking_params[:match_id])

SELECT  "matchmakings".* FROM "matchmakings" WHERE "matchmakings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        begin
            @matchmaking = Matchmaking.find(params[:id])