backend/app/controllers/matches_controller.rb

    def index
        @matches = Match.all
---
SELECT "matches".* FROM "matches"

    def show
        begin
            @match = Match.find(params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]

    def update
        begin
            @match = Match.find(params[:id])
            #TODO: Custom validation here?
            if @match.completed != true && @match.update(completed: true)
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "matches" SET "completed" = $1, "updated_at" = $2 WHERE "matches"."id" = $3  [["completed", true], ["updated_at", "2018-09-11 15:51:01.879601"], ["id", 6]]

    def destroy
        begin
            @match = Match.find(params[:id])
            @match.destroy
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 1]]