backend/app/controllers/users_controller.rb

    def show
        begin
            @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def join_game
        begin
            @matches = Match.where("player_count < 4")
            @user = User.find(params[:id])
            if @matches.empty? && @user.in_match != true
                @match = Match.create()
                @match.matchmaking.create(user_id: params[:id])
                @user.toggle_in_match()
                render json: {result: "A new match was created."}
            elsif @user.in_match != true
                @match = @matches.all.first
                @match.matchmaking.create(user_id: params[:id])
                @match.update(player_count: @match.player_count + 1)
                @user.toggle_in_match()
---
SELECT  "matches".* FROM "matches" WHERE (player_count < 4) ORDER BY "matches"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  1 AS one FROM "matches" WHERE (player_count < 4) LIMIT $1  [["LIMIT", 1]]
INSERT INTO "matches" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-09-11 20:09:06.972936"], ["updated_at", "2018-09-11 20:09:06.972936"]]
INSERT INTO "matchmakings" ("user_id", "match_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["match_id", 1], ["created_at", "2018-09-11 20:09:06.993579"], ["updated_at", "2018-09-11 20:09:06.993579"]]
UPDATE "users" SET "in_match" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["in_match", true], ["updated_at", "2018-09-11 19:41:48.675688"], ["id", 4]]
UPDATE "matches" SET "player_count" = $1, "updated_at" = $2 WHERE "matches"."id" = $3  [["player_count", 2], ["updated_at", "2018-09-11 19:11:24.301983"], ["id", 9]]
SELECT "matchmakings".* FROM "matchmakings" WHERE "matchmakings"."match_id" = $1  [["match_id", 9]]
INSERT INTO "matchmakings" ("user_id", "match_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["match_id", 1], ["created_at", "2018-09-11 20:10:06.430372"], ["updated_at", "2018-09-11 20:10:06.430372"]]
UPDATE "matches" SET "player_count" = $1, "updated_at" = $2 WHERE "matches"."id" = $3  [["player_count", 2], ["updated_at", "2018-09-11 20:10:06.432798"], ["id", 1]]
UPDATE "matches" SET "player_count" = $1, "updated_at" = $2 WHERE "matches"."id" = $3  [["player_count", 2], ["updated_at", "2018-09-11 20:58:21.119648"], ["id", 4]]

    def destroy
        begin
            @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]